/*
Ещё парсер по грамматике, данной на вход программе.
Программа может принимать грамматику файлом или через stdin.
Дальше она проверяет, является ли она LL1.
Дальше, если она LL1, она может принять последовательность токенов (короче, строку для парсинга) и парсит эту строку.
Если она грамматически верна (ещё говорят семантически), то программа выдаёт parse tree в каком-то формате. Можно JSON.
Если она грамматически неверна, то выдать ошибку, в каком месте ожидался символ.
Когда будете читать алгоритм создания алгоритма LL1 парсера(а это то, что вам нужно, так как просто алгоритм парсера это то, что получается при конкретной грамматике, а вы её заранее не знаете), там это должно быть.
*/

#include <iostream>

int main() {

    return 0;
}
